import matplotlib
import numpy as np

matplotlib.use('TkAgg')  # 或 'Qt5Agg', 'Agg' 等
from matplotlib import pyplot as plt

from load_proto import simple_digit_processing_quick


def plot_pixels_1d(pixels, img_shape=(8, 8)):
    """绘制一维像素数组"""
    if len(pixels) == img_shape[0] * img_shape[1]:
        # 重塑为2D
        img_2d = pixels.reshape(img_shape)

        plt.figure(figsize=(6, 6))
        plt.imshow(img_2d, cmap='gray')
        plt.colorbar(label='px')
        plt.title(f'px_proto ({img_shape[0]}x{img_shape[1]})')
        plt.axis('off')
        plt.show()

        return img_2d
    else:
        print(f"错误：像素数量{len(pixels)}不匹配形状{img_shape}")

pixels = simple_digit_processing_quick('/Users/Liuhaixin/Downloads/9.png')
# str = '0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	80	218	254	254	163	14	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	6	188	254	253	253	253	253	122	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	11	213	253	254	236	111	238	253	238	31	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	15	178	253	235	26	19	0	227	253	245	41	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	118	253	230	23	0	0	47	241	253	218	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	30	244	250	105	0	0	59	229	253	253	133	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	105	253	235	1	27	115	248	253	253	248	39	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	87	253	249	194	253	254	253	253	253	107	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	22	196	244	211	156	223	253	253	208	10	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	254	253	253	26	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	116	255	254	108	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	33	250	254	161	7	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	5	164	253	235	6	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	36	253	253	48	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	14	212	253	192	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	5	148	253	245	14	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	75	253	251	128	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	19	207	253	199	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	111	253	243	62	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	19	230	253	166	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0'
# lists = str.split('	')

# pixels = np.array([int(x) for x in lists])


# 使用
img = plot_pixels_1d(pixels, (28, 28))

# 查看重塑后的数组
print("重塑后的2D数组:")
print(img)
